# ##########################################################
# ファイル読み込み
# ##########################################################
# file = open('content/sample.txt', 'r')
# text = file.read()
# file.close
# print(text)


# ##########################################################
# ファイル読み込み（with）
# ##########################################################
# with open('./content/sample.txt') as file:
#     text = file.read()
# print(text)


# ##########################################################
# jsonファイル読み込み
# ##########################################################
# import json
# with open('./content/sample.json', 'r') as file:
#     data = json.load(file)
# print(data)
# print(data["store_name"])


# ##########################################################
# カレントディレクトリ内のファイル情報を表示
# ##########################################################
# import os
# for curDir, dirs, files in os.walk('.'):
#     for file in files:
#         print(f'{ curDir }/{ file }')


# ##########################################################
# カレンとディレクトリ内のファイル情報を表示（ディレクトリは名称をそのまま）
# ##########################################################
# import os
# lists = os.listdir('.')
# print(lists)


# ##########################################################
# カレントディレクトリ内のファイルの絶対パスを取得
# ##########################################################
import os
for curDir, dirs, files in os.walk('.'):
    for file in files:
        print(os.path.abspath(file))
        print(file)
